ES1C/src/DataProcessors/md_АдминистраторElasticSearch/md_АдминистраторElasticSearch.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>md_АдминистраторElasticSearch</name>
  <attributes>
    <name>СсылкаНаОбъект</name>
    <type>
      <types>DefinedType.md_ОбъектыВерсионированияElasticSearch</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверElasticsearch</name>
    <type>
      <types>CatalogRef.md_СервераElasticsearch</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексES</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоВерсий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтбора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСравнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

ES1C/src/InformationRegisters/md_НастройкаВерсионированияОбъектовВElasticsearch/md_НастройкаВерсионированияОбъектовВElasticsearch.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>md_НастройкаВерсионированияОбъектовВElasticsearch</name>
  <resources>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПакетнаяОтправка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособСериализации</name>
    <type>
      <types>EnumRef.md_СпособыСериализацииДокументовElasticsearch</types>
    </type>
  </resources>
  <resources>
    <name>Приостановлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СерверElasticsearch</name>
    <type>
      <types>CatalogRef.md_СервераElasticsearch</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИндексES</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ES1C/src/Catalogs/md_СервераElasticsearch/md_СервераElasticsearch.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>md_СервераElasticsearch</name>
  <attributes>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ES1C/src/DataProcessors/md_АдминистраторElasticSearch/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСтатистикуПоСерверам(ДеревоОбъектов) Экспорт

	ДеревоОбъектов.Строки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	md_СервераElasticsearch.Ссылка КАК СерверES,
		|	md_СервераElasticsearch.АдресСервера КАК АдресСервера,
		|	md_СервераElasticsearch.Порт КАК Порт,
		|	md_НастройкаВерсионированияОбъектовВElasticsearch.ИндексES КАК ИндексES,
		|	md_НастройкаВерсионированияОбъектовВElasticsearch.ТипМетаданных КАК ТипМетаданных,
		|	0 КАК Doc_count,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(200)) КАК Кey
		|ИЗ
		|	РегистрСведений.md_НастройкаВерсионированияОбъектовВElasticsearch КАК md_НастройкаВерсионированияОбъектовВElasticsearch
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.md_СервераElasticsearch КАК md_СервераElasticsearch
		|		ПО md_НастройкаВерсионированияОбъектовВElasticsearch.СерверElasticsearch = md_СервераElasticsearch.Ссылка
		|ИТОГИ ПО
		|	СерверES";
	
	РезультатЗапроса = Запрос.Выполнить();
	ДеревоОбъектов= РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для каждого СтрокаСерверES Из ДеревоОбъектов.Строки Цикл
	
		Для каждого СтрокаИндексES Из СтрокаСерверES.Строки Цикл
		
			ПолучитьСтатистикуДляСтрокиИндекса(СтрокаИндексES);		
		
		КонецЦикла; 		
	
	КонецЦикла; 	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПолучениеСтатистики

Процедура ПолучитьСтатистикуДляСтрокиИндекса(ОписаниеИндексаES)
	
	Если не ЗначениеЗаполнено(ОписаниеИндексаES.ИндексES)  Тогда
	
		Возврат;
	
	КонецЕсли; 
	
	ТелоЗапроса = "{""aggregations"": {""my_agg"": {""terms"": {""field"": ""Metadata_FullName.keyword"", ""size"": 100}}}}";
	
	ЗаголовкиЗапроса = Новый Соответствие;
	ЗаголовкиЗапроса.Вставить("Content-Type","application/json");
	
	СтруктураОтправкиПакета = Новый Структура("АдресСервера,Порт");
	ЗаполнитьЗначенияСвойств(СтруктураОтправкиПакета,ОписаниеИндексаES);
	
	СтруктураОтправкиПакета.Вставить("Заголовки", ЗаголовкиЗапроса);
	СтруктураОтправкиПакета.Вставить("АдресРесурса",
    md_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1/_search", ОписаниеИндексаES.ИндексES));
	СтруктураОтправкиПакета.Вставить("HTTPМетод", "POST");
	СтруктураОтправкиПакета.Вставить("ВидОперации", "Статистика по индексу");
	СтруктураОтправкиПакета.Вставить("ТелоЗапроса", ТелоЗапроса);
	СтруктураОтправкиПакета.Вставить("УникальныйИдентификатор", Новый УникальныйИдентификатор);
	
	ОтветES = md_ВерсионированиеElasticsearchВызовСервера.ВыполнитьЗапросКElasticSearch(СтруктураОтправкиПакета);
	
	Если ОтветES.КодСостояния >= 200 и ОтветES.КодСостояния < 300 Тогда
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ОтветES.ТелоОтвета);
        
        Пока ЧтениеJSON.Прочитать() Цикл
			
			Если ЧтениеJSON.ТипТекущегоЗначения = ТипЗначенияJSON.ИмяСвойства 
				И ЧтениеJSON.ТекущееЗначение = "aggregations" Тогда
				
				Aggregations = ПрочитатьJSON(ЧтениеJSON, Истина);
				
				Для Каждого Buckets из Aggregations.Получить("my_agg").Получить("buckets") Цикл
					
					СтатистикаИндекса = ОписаниеИндексаES.Строки.Добавить();
					СтатистикаИндекса.Кey = Buckets.Получить("key");
					СтатистикаИндекса.Doc_count = Число(Buckets.Получить("doc_count"));
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
